[
  {
    "path": "posts/2021-02-18-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "This post aims to critique a published chart's data visualization and aesthetics, and in turn propose and design a new chart that can better visualize the findings from the report.",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-02-18",
    "categories": [],
    "contents": "\r\nISSS608 Visual Analytics and Applications - DataViz Makeover 2 \r\nData Visualization (Tableau Online)\r\nGiven chart:\r\n\r\n\r\n\r\n1.0 Data Visualization Critique\r\n 1.1 Clarity \r\nThe given diagram consists of two charts, with the Likert chart on the left visualizing which country is more pro-vaccine, and a bar chart on the right which attempts to visualize the percentage of those who strongly agree to vaccination in each country.\r\nFor easier identification in the critique of the two charts, the Likert chart on the left will be referred to as Chart A, while the bar chart on the right will be referred to as Chart B.\r\nThe chart title for Chart A, “Which country is more pro-vaccine” is not answered in the chart where no findings or answers can be intuitively found from the chart. The response of agree or disagree is not an appropriate response to this title as well. Instead, the chart title can indicate what the chart is about, for example the proportion of responses for survey question.\r\nThe colours used for the chart may be confusing as every response is given a different colour. The colours used may be misleading as well, for example red representing score of 3, which is a neutral score. However, red is usually associated with something negative. A colour gradient might be able to better portray the varying response since they are ordinal data with appropriate colours.\r\nAs the proportions for each response across the different countries do not have a common or baseline reference, it is difficult to make comparisons between countries, especially when the differences are not significant. A diverging stacked bar chart might make it easier to perform comparisons.\r\nThe axes are clearly labelled, to indicate the country as well as the percentage response.\r\nChart B is sorted in descending order which makes it clear which country has the highest percentage of respondents giving a “Strongly Agree” response to the survey question.\r\n1.2 Aesthetics \r\nThe label of “vac_1” above the legend is not useful in this case which may end up confusing readers on what the response means. It can be removed as the legend is intuitive enough without a title.\r\nScores 2 to 4 do not have any indication on what the response is. It will be clearer to indicate “Agree”, “Neutral” and “Disagree” for scores 2 to 4 respectively.\r\nCountry names are in the lower case when they should be capitalized, since country names are nouns.\r\nColours used in both charts are consistent, where percentage strongly agree in Chart B is also indicated in blue, similar to Chart A.\r\nThe source of the data is not provided.\r\n2.0 The New Design\r\n2.1 Draft Design \r\nTaking into account the points mentioned above, a proposed design was drafted as below.\r\nAdvantages of this design: - Title to clearly defined to correctly represent the data presented\r\nGradient of colours to be used to indicate the varying degree of agreeability, with neutral marked as grey\r\nUtilize diverging stacked bar chart where there is a baseline reference in the middle of the neutral input\r\nLegend to indicate response in words rather than numbers to have clarity on the response types\r\nCountry names capitalized\r\nAdd source of data\r\nPresent Chart B as an error plot to take into account the sample size from the survey (to present at 95% confidence level)\r\nTo add demographics selection for users to see how with adding or removing a certain demographic changes the final response\r\n2.2 Preparation of Data Visualization \r\nThe data used was obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub.\r\nThe data obtain consisted of 30 csv files, each presenting data from a country. However, not all 30 were shown in the given chart. Hence, the data sets not required were removed from the folder, leaving behind the data sets for the 14 countries presented.\r\nPreparing data source in Excel:\r\nEach of the datasets were opened to be reviewed and there were a few observations:\r\nNot all fields were useful for this visualization, hence they were be removed.\r\nFor the survey responses, there were multiple empty fields. This was be taken into account subsequently, resolved with a filter to exclude null values.\r\nInput method 1:\r\n\r\n\r\n\r\nInput method 2:\r\n\r\n\r\n\r\nThe fields for employment status varied from file to file.\r\nThis was resolved by creating new calculated fields discussed later.\r\nThe remaining fields are:\r\nRecordNo\r\nHousehold_children\r\nHousehold_size\r\nAge\r\nGender\r\nEmployment_status (or Employment_status1 to Employment_status7)\r\nVac_1\r\nVac_2\r\nVac2_1\r\nVac2_2\r\nVac2_3\r\nVac2_6\r\nVac3\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-18-dataviz-makeover-2/givenchart.png",
    "last_modified": "2021-02-19T00:33:26+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-02-02-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post aims to critique a published chart's data visualization and aesthetics, and in turn propose and design a new chart that can better visualize the findings from the report.",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-02-02",
    "categories": [],
    "contents": "\r\nISSS608 Visual Analytics and Applications - DataViz Makeover 1 \r\nData Visualization (Tableau Online)\r\nGiven chart:\r\n\r\n\r\n\r\n1.0 Data Visualization Critique\r\n 1.1 Clarity \r\nChart title can be clearer by including the time frame of comparison as well as being clear on what “per cent” refers to.\r\nThe chart type used, a line-graph, is misleading as intuitively it seems like the resident labour force is being presented as labour force over time. However, the X-axis represents the various age groups, instead of time.\r\nThe groupings discussed in the summary (aged 55 & over, 25 to 54) are not the groupings shown in the chart, where the groups are categorized in intervals of 5 years. Hence, data cited in the summary is not able to be immediately seen without calculation by adding the labour force percentages of the age groups.\r\nY-axis is not presented in the chart. Instead, the values are shown below the X-axis. This makes it more difficult to correlate the significance of any rise and decline in the chart.\r\nFrom the chart, it is clear whether the resident labour force was higher or lower for each age group in June 2009 or June 2019 by looking at which line is higher than the other for each data point. This will be a point to be kept in view for the new design.\r\n1.2 Aesthetics \r\nA brighter colour aside from grey could have been used for June 2009 data to further distinguish itself from the non-data ink such as the table’s borders or the text for source. This allows text to have a greater contrast from the chart details.\r\nThe chart layout could be neater by aligning the source and note at the bottom, then further reducing the text.\r\nIn the summary, usage of font formatting can be used to attract readers’ attention on certain key points of focus, for example some of the percentage rise or decline.\r\nGood use of colour to distinguish information related to June 2009 (grey) or June 2019 (blue) where the line graph, median line, text, labels, as well as the table of values are all coloured accordingly. This will be kept for the new design.\r\n2.0 The New Design\r\n2.1 Draft Design \r\nTaking into account the points mentioned above, a proposed design was drafted as below.\r\n\r\n\r\n\r\nAdvantages of this design:\r\nWill provide clearer comparisons between the different age groups – 25 to 54 and 55 & above as described in the summary given.\r\nThe percentages mentioned can be clearly seen from each of the bar charts.\r\nThe charts will have corresponding Y-axes to visualize the extent of growth or decline in each chart.\r\nCharts and plots will be colour coded for easy identification of each field or variable and clearly segregated bt age group.\r\nText inputs in the chart area can be clearer due to greater contrast by changing chart colours to brighter tones.\r\n2.2 Preparation of Data Visualization \r\nTwo data sources were used:\r\nTable 7: Resident labour force aged fifteen years and over by age and sex, 2009 – 2019 (June)\r\nSingapore Residents BY Age Group, Ethnic Group And Sex, End June, Annual\r\nPreparing data source in Excel:\r\nCalculations from these two data sources were performed to create a new data table with age groups “25 to 54” and “55 & above” for labour force participation rate (LFPR) and labour force proportion with the following calculation method.\r\nLFPR = (Sum of labour force in age group / Sum of population in age group) *100\r\nLabour force proportion = (Sum of labour force in age group / Total labour force) * 100\r\n\r\n\r\n\r\nImporting Data Into Tableau:\r\nThe file was dragged and dropped into Tableau. Then, the Data sheet was dragged into the area labelled “Drag tables here”.\r\n\r\n\r\n\r\nChecking of Imported Data:\r\nThe data type of Year was changed to “Date” as shown below.\r\n\r\n\r\n\r\nData for LFPR and Proportion were ensured to be all in “Number (decimal)”.\r\n\r\n\r\n\r\nCreating Bar Charts:\r\nTo create the first chart for visualizing the data for “25 to 54”, the field “Year” was dragged into the Columns field. Then, “LFPR (25 to 54)” and Proportion (25 to 54)” were dragged into the Rows field.\r\n\r\n\r\n\r\nTo see only data for 2009 and 2019, “Year” was dragged into the Filters space. Then, only 2009 and 2019 were checked.\r\n\r\n\r\n\r\nThe chart title was renamed to “Age Group: 25 to 54”.\r\n\r\n\r\n\r\nThe proportion chart and LFPR chart were coloured to clearly identify which chart belongs to LFPR and which belongs to proportion.\r\n\r\n\r\n\r\nThe Y-axis were edited to fix the range at 0% to 100% and to rename the axis.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe same was repeated for age group 55 and above.\r\nCreating the Line Chart:\r\n“Year” was dragged into the Columns field, while the other 4 fields were pulled into the Rows field.\r\n\r\n\r\n\r\nMerging the Line Graphs Into One Chart:\r\nSince all 4 plots are in percentage, they can be merged into one chart. This was done by dragging the last three fields into the first chart’s axis.\r\n\r\n\r\n\r\n\r\n\r\n\r\nChanging Y-Axis:\r\nTo show the full 0% to 100%, the axis was edited by fixing the start and end of the range.\r\n\r\n\r\n\r\nColour-coding LFPR and Proportion:\r\nTo better visualize which plot refers to LFPR and Proportion, they were colour-coded by using the Edit Colours function.\r\n\r\n\r\n\r\n\r\n\r\n\r\nDashboard Assembly:\r\nThe 3 worksheets were pulled into the dashboard. Textboxes were added for the chart title, short summary as well as the data source. Blank spaces were added to aid alignment.\r\n\r\n\r\n\r\n3.0 The Observations\r\nThe growth of proportion in residents 55 and above in the labour force was substantial, rising by about 9%. While LFPR for both age groups increased, only age group 55 and above grew in proportion while age group 25 to 54 declined. This means that despite a proportion LFPR of people in age group 25 to 54 being part of the labour force, the contribution by this age group to total labour force still declined, showing that the population of this age group was shrinking.\r\nWhile there was a slight growth in LFPR for age group 25 to 54 from 2009 to 2019 (about 5%), it might be assumed that this is a steady rise. However, from the graph we can see that it only grew from 2009 to 2014, then started to decline from 2014 onwards steadily. This was not able to be captured if only data from 2009 and 2019 was taken for study. There might be an event that caused this age group to deviate from joining the work force, with reasons such as a push for furthering studies, or a significant proportion of the older residents who were contributing in LFPR in this age group transiting to the next age group (55 and above) from 2014 onwards.\r\nThe rise and decline for proportion of labour force are generally following a trend, with age group 25 to 54 seeing a steady decline while age group 55 and above a steady rise. This can be explained with the findings of Singapore’s shrinking birth rate, resulting in smaller population for each subsequent younger age group.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-02-dataviz-makeover-1/givenchart.png",
    "last_modified": "2021-02-04T00:22:18+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-01-31",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-31T23:16:58+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-31-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-01-31",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-31-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-02-02T21:49:12+08:00",
    "input_file": "my-first-post.utf8.md"
  }
]
