[
  {
    "path": "posts/2021-03-16-dataviz-makeover-3/",
    "title": "DataViz Makeover 3",
    "description": "This post aims to critique a published chart's data visualization and aesthetics, and in turn propose and design a new chart that can better visualize the findings from the report.",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-03-16",
    "categories": [],
    "contents": "\r\nISSS608 Visual Analytics and Applications - DataViz Makeover 2 \r\nData Visualization (Tableau Online)\r\nGiven chart:\r\n\r\n\r\n\r\n1.0 Data Visualization Critique\r\nThe given diagram consists of two charts, with the map visualization on the left showing the different events happening in South-East Asia, and a line graph on the right which attempts to visualize the trend of the various event types for each country. Here, the clarity, aesthetics and interactivity will be critiqued.\r\n 1.1 Clarity \r\nThe titles for the charts include useful information such as the country selected and the year range for the map\r\noverlapping data - transparency?\r\n1.2 Aesthetics \r\nOn the map chart, the different event types are colour-coded which allows the user to very quickly tell which are the hot spots for each event type in various locations on the map. This colour-coding should be kept for the new proposed design.\r\nThe Y-axis on the line graphs are labelled “Count of Sheet1” which is not useful for the user as Sheet1 holds no meaning for the user. It should instead be labelled as “Count”.\r\n1.3 Interactivity \r\nThe details in the tool tip is not useful for the user, specifically the event ID, latitude and longitude that is probably not of use to the user. Instead, the name of the country and province or state, the groups involved in the event and some notes on the specific event will be more useful.\r\nA date slider can be implemented for the user to choose a specific date range in the event his or her interest is only for a particular time frame.\r\nAs some points may be covered by others on the map, some data points may be missed out in the visualization. To resolve this, a filter for the event type can firstly be implemented to prevent certain event types from overlapping each other.\r\nNew Proposed Design\r\nSince the data on the given map chart is scattered and there is no function to see an overview of events that happened in each state or province, a new map that shows the breakdown of the accumulation of the different types of events for each state was implemented. A selection tool will be implemented to allow the user to switch between the two provided maps.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-16-dataviz-makeover-3/givenchart.png",
    "last_modified": "2021-03-18T19:40:38+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-18-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "This post aims to critique a published chart's data visualization and aesthetics, and in turn propose and design a new chart that can better visualize the findings from the report.",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-02-18",
    "categories": [],
    "contents": "\r\nISSS608 Visual Analytics and Applications - DataViz Makeover 2 \r\nData Visualization (Tableau Online)\r\nGiven chart:\r\n\r\n\r\n\r\n1.0 Data Visualization Critique\r\n 1.1 Clarity \r\nThe given diagram consists of two charts, with the Likert chart on the left visualizing which country is more pro-vaccine, and a bar chart on the right which attempts to visualize the percentage of those who strongly agree to vaccination in each country.\r\nFor easier identification in the critique of the two charts, the Likert chart on the left will be referred to as Chart A, while the bar chart on the right will be referred to as Chart B.\r\nThe chart title for Chart A, “Which country is more pro-vaccine” is not answered in the chart where no findings or answers can be intuitively found from the chart. The response of agree or disagree is not an appropriate response to this title as well. Instead, the chart title can indicate what the chart is about, for example the proportion of responses for survey question.\r\nThe colours used for Chart A may be confusing as every response is given a different colour. The colours used may be misleading as well, for example red representing score of 3, which is a neutral score. However, red is usually associated with something negative. A colour gradient with appropriate colours might be able to better portray the varying response since they are ordinal data.\r\nAs the proportions for each response across the different countries in Chart A do not have a common or baseline reference, it is difficult to make comparisons between countries, especially when the differences are not significant. A diverging stacked bar chart might make it easier to perform comparisons.\r\nFor both charts, the axes are clearly labelled, to indicate the country as well as the percentage response.\r\nChart B is sorted in descending order which makes it clear which country has the highest percentage of respondents giving a “Strongly Agree” response to the survey question.\r\n1.2 Aesthetics \r\nThe label of “vac_1” above the legend is not useful in this case which may end up confusing readers on what the response means. It can be removed as the legend is intuitive enough without a title.\r\nScores 2 to 4 do not have any indication on what the response is. It will be clearer to indicate “Agree”, “Neutral” and “Disagree” for scores 2 to 4 respectively.\r\nCountry names are in the lower case when they should be capitalized, since country names are nouns.\r\nColours used in both charts are consistent, where percentage strongly agree in Chart B is also indicated in blue, similar to Chart A.\r\nThe source of the data is not provided.\r\n2.0 The New Design\r\n2.1 Draft Design \r\nTaking into account the points mentioned above, a proposed design was drafted as below.\r\n\r\n\r\n\r\nAdvantages of this design:\r\nTitle to clearly defined to correctly represent the data presented\r\nGradient of colours to be used to indicate the varying degree of agreeability, with neutral marked as grey\r\nUtilize diverging stacked bar chart where there is a baseline reference in the middle of the neutral input\r\nLegend to indicate response in words rather than numbers to have clarity on the response types\r\nCountry names capitalized\r\nAdd source of data\r\nPresent Chart B as an error plot to take into account the sample size from the survey (to present at 95% confidence level)\r\nTo add demographics selection for users to see how with adding or removing a certain demographic changes the final response\r\n2.2 Preparation of Data Visualization \r\nThe data used was obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub.\r\nThe data obtained consists of 30 csv files, each presenting data from a country. However, not all 30 were shown in the given chart, such as Brazil and China. Hence, the data sets not required were removed from the folder, leaving behind the data sets for the 14 countries presented.\r\nPreparing data source in Excel:\r\nEach of the datasets were opened to be reviewed and there were a few observations:\r\nNot all fields were useful for this visualization, hence they were removed.\r\nFor the survey responses, there were multiple empty fields. This was taken into account subsequently, resolved with a filter to exclude null values.\r\nThe fields for employment status varied from file to file (see below). This was resolved by creating new calculated fields discussed later.\r\nInput method 1:\r\n\r\n\r\n\r\nInput method 2:\r\n\r\n\r\n\r\nThe remaining fields are:\r\nRecordNo\r\nHousehold_children\r\nHousehold_size\r\nAge\r\nGender\r\nEmployment_status (or Employment_status1 to Employment_status7)\r\nVac_1\r\nVac_2\r\nVac2_1\r\nVac2_2\r\nVac2_3\r\nVac2_6\r\nVac3\r\nImporting Data Into Tableau and Data Preparation:\r\nThe australia.csv file was dragged and dropped into Tableau.\r\n\r\n\r\n\r\nTo create a new union, the australia.csv file was first removed, then New Union was selected where the datasets for the 14 countries were pulled in.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nTo have a field which indicates which Country the datapoint is for, the Table Names column which was automatically generated through the New Union function was used. The field title was double clicked and changed to Country. Aliases were also created to ensure the country names are without the “.csv” and with the first letter being upper case.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe survey questions were highlighted and pivoted, using the Pivot function under the small triangle dropdown icon.\r\n\r\n\r\n\r\nThe field names of the two newly created fields were changed to “Survey Question” and “Response”. Aliases were also created for Survey Question, where the respective questions were used as the alias.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSince the responses were identified as strings due to characters such as in “1 - Strongly Agree”, for the chart to be plotted with scores that use integers, a new calculated field was created by using the Create Calculated Field function with the following formula.\r\n\r\n\r\n\r\n\r\n\r\n\r\nCreating The Diverging Stacked Bar Chart:\r\nMoving to Sheet 1, the field numeric_response was converted to dimension by clicking on the small triangle drop down icon on it and selecting Convert to Dimension.\r\n\r\n\r\n\r\nTo first remove null response values, “Numeric_Response” was dragged to the Filter field. Here, null values were excluded by checking “Null” and checking the “Exclude” checkbox.\r\n\r\n\r\n\r\n\r\n\r\n\r\nTo show the description of each score, aliases were given to each of the input scores.\r\n\r\n\r\n\r\n\r\n\r\n\r\nIn order to calculate the proportions of the responses in a diverging stacked bar chart, the following new calculated fields were created with the following formula:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThen, Gantt Proportion was dragged into the Columns field, followed by Survey Question into the Filters field where vac_1, now aliased to “If a Covid-19 vaccine were made available to me this week, I would definitely get it:” was selected. This is to set responses in the diverging stacked bar chart to reflect only responses in for this specific survey question.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe field “Country” was pulled into the Rows field\r\n\r\n\r\n\r\nUnder Marks, the Gantt Bar chart type was selected.\r\n\r\n\r\n\r\nSubsequently, “Numeric_Response” was pulled into the Detail icon.\r\n\r\n\r\n\r\nThe “Gantt Proportion” in the Columns field was computed using “Numeric_Response”.\r\n\r\n\r\n\r\nTo identify each survey response with a differenet colour, “Numeric_Response” was dragged into the Color icon.\r\n\r\n\r\n\r\nTo visualize the length of the chart based on proportion, “Proportion” was dragged into the Size icon.\r\n\r\n\r\n\r\nTo create a gradient of colours for the responses, under the triangle drop down icon of the legend, the Edit Colors function was selected. Colours were chosen to reflect the common association with green being agree and red being disagree. Further, strongly agree and strongly disagree were chosen to be indicated by darker shades of green and red respectively. Neutral was indicated as grey.\r\n\r\n\r\n\r\n\r\n\r\n\r\nNext, to present the chart with agree on the right side per the given chart, the Edit Axis function was utilized where both Synchronize Axis and Reversed was selected.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nCreating The Error Plot:\r\nA new sheet was created and new calculated fields were created as follows:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe field “Proportion” was pulled into the Columns field.\r\n\r\n\r\n\r\nFrom Marks, Circle was selected.\r\n\r\n\r\n\r\nWith the same steps from before, null values were removed by filtering “Numeric_Response” and to address one survey question at a time, “Survey Question” was filtered as well. Since the error plot is to provide insights on the other survey questions also, the Show Filter option was selected.\r\n\r\n\r\n\r\nNext, “Country” was pulled into the Rows field.\r\n\r\n\r\n\r\nThen, Measure Values was pulled to the top of the chart. Subsequently, all fields were removed asides from “Lower Limit” and “Upper Limit”.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThen, the x-axis was synchronized.\r\n\r\n\r\n\r\nUnder “Measure Values” in Marks, the Line chart was selected. Then, Measure Names was pulled into the Path icon.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe colour was edited to be identical to the first chart where green colour was used to represent Strongly Agree.\r\n\r\n\r\n\r\nCreating New Fields For Demographics:\r\nFor both Age Group and Household Size, the Create Group function was used to create groups. For Age Group, asides from 18 to 25 and 76 and above, the remaining ages were split into groups of 10 years intervals. As for Household Size, inputs “Null”, “Don’t know” and “Prefer not to say” were grouped as one, 1 to 3 was grouped as one, 4 to 6 in another and 7 or more forming the last group. The names of each group was also edited for clarity.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nFor employment, as mentioned earlier, more work is required to resolve the difference in input methods. Firstly, a new calculated field was created to combine all the inputs for “employment_status1” to “employment_status7”.\r\n\r\n\r\n\r\nThen, another new calculated field was used to collate all inputs of “Employment 1-7”, and in instances of null, it will take the input of “employment_status”. This hence combines both methods of inputs for employment status.\r\n\r\n\r\n\r\nThe filters of “gender”, “Age Groups”, “Household Size” and “Combined Employment” were then added into the Filters field, along with “Numeric_Response” and “Survey Question”. Then, to apply only “gender”, “Age Groups”, “Household Size” and “Combined Employment” to the diverging stacked bar chart, “All Using This Data Source” were selected for these fields.\r\nSince for Survey Question it makes sense only if the response is to one question, the filter was changed to Single Value (list) while the rest remained with Multiple Values (list). This will allow users to visualize different combinations of demographics. After all is prepared, the selection Show Filter was selected.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNext, animations were selected so that users can see how data changes in a clearer way.\r\n\r\n\r\n\r\n\r\n\r\n\r\nCreating The Dashboard:\r\nA new dashboard was created and the Size was selected to be Automatic.\r\n\r\n\r\n\r\nSheet 1 and Sheet 2 were subsequently dragged into the dashboard field. Along with Sheet 2, the filters were added as well. The sheet titles were edited to describe the respective charts. In addition, a short sentence to describe how it can be tweaked with the filters available was given, so that users know how to utilize the interactivity. For Sheet 2, another line to indicate the 95% confidence level was added for clarity on the lines presented in the chart.\r\n\r\n\r\n\r\nTo create a space between the charts to ensure that it is not too cluttered, a blank was placed in the middle.\r\n\r\n\r\n\r\nAs the survey questions would be too long to be put at the side, it was dragged down to the bottom of the dashboard so that the entire question can be seen at one glance. As there was additional space beside the survey questions, the space was utlized by putting in a blank and dragging Employment down beside it so that more demographics selection can be seen.\r\n\r\n\r\n\r\nLastly, the source was added right at the bottom of the chart using the Text function.\r\n\r\n\r\n\r\nThis is the final layout of the dashboard.\r\n\r\n\r\n\r\n3.0 The Observations\r\nBy comparing the results from the error plot between male and female respondents for those who strongly agree to the question “If a Covid-19 vaccine becomes available to me in 2021, I definitely intend to get it”, it can be observed from ther error plot that females are more agreeable to get vaccinated. This observation is the same through all countries.\r\n\r\n\r\n\r\nWhile Japan had the smallest proportion of respondents who strongly agreed that they will get vaccinated if made available to them. However, Japan had the largest prorpotion of respondents who strongly agreed that they were worried about getting Covid-19, with about 10% more than the next country. One observation on why this is so can be observed from the response on whether they strongly agreed that their government health authorities will provide them with an effective Covid-19 vaccine.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nIt was observed that the proportion of respondents across the 14 countries in the age group 56 and over were more receptive towards taking a vaccine if made available, compared to those in age group 18 to 55. This can be observed by the shrinking of the green bars when we compare the older age group vs the younger age group through the diverging stacked bar chart. Based on the error plot, we can also see that the proportions that strongly agree are lower in the younger age group.\r\nAge 55 and above\r\n\r\n\r\n\r\nAge 18 to 55\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-18-dataviz-makeover-2/givenchart.png",
    "last_modified": "2021-02-19T16:01:54+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-02-02-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post aims to critique a published chart's data visualization and aesthetics, and in turn propose and design a new chart that can better visualize the findings from the report.",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-02-02",
    "categories": [],
    "contents": "\r\nISSS608 Visual Analytics and Applications - DataViz Makeover 1 \r\nData Visualization (Tableau Online)\r\nGiven chart:\r\n\r\n\r\n\r\n1.0 Data Visualization Critique\r\n 1.1 Clarity \r\nChart title can be clearer by including the time frame of comparison as well as being clear on what “per cent” refers to.\r\nThe chart type used, a line-graph, is misleading as intuitively it seems like the resident labour force is being presented as labour force over time. However, the X-axis represents the various age groups, instead of time.\r\nThe groupings discussed in the summary (aged 55 & over, 25 to 54) are not the groupings shown in the chart, where the groups are categorized in intervals of 5 years. Hence, data cited in the summary is not able to be immediately seen without calculation by adding the labour force percentages of the age groups.\r\nY-axis is not presented in the chart. Instead, the values are shown below the X-axis. This makes it more difficult to correlate the significance of any rise and decline in the chart.\r\nFrom the chart, it is clear whether the resident labour force was higher or lower for each age group in June 2009 or June 2019 by looking at which line is higher than the other for each data point. This will be a point to be kept in view for the new design.\r\n1.2 Aesthetics \r\nA brighter colour aside from grey could have been used for June 2009 data to further distinguish itself from the non-data ink such as the table’s borders or the text for source. This allows text to have a greater contrast from the chart details.\r\nThe chart layout could be neater by aligning the source and note at the bottom, then further reducing the text.\r\nIn the summary, usage of font formatting can be used to attract readers’ attention on certain key points of focus, for example some of the percentage rise or decline.\r\nGood use of colour to distinguish information related to June 2009 (grey) or June 2019 (blue) where the line graph, median line, text, labels, as well as the table of values are all coloured accordingly. This will be kept for the new design.\r\n2.0 The New Design\r\n2.1 Draft Design \r\nTaking into account the points mentioned above, a proposed design was drafted as below.\r\n\r\n\r\n\r\nAdvantages of this design:\r\nWill provide clearer comparisons between the different age groups – 25 to 54 and 55 & above as described in the summary given.\r\nThe percentages mentioned can be clearly seen from each of the bar charts.\r\nThe charts will have corresponding Y-axes to visualize the extent of growth or decline in each chart.\r\nCharts and plots will be colour coded for easy identification of each field or variable and clearly segregated bt age group.\r\nText inputs in the chart area can be clearer due to greater contrast by changing chart colours to brighter tones.\r\n2.2 Preparation of Data Visualization \r\nTwo data sources were used:\r\nTable 7: Resident labour force aged fifteen years and over by age and sex, 2009 – 2019 (June)\r\nSingapore Residents BY Age Group, Ethnic Group And Sex, End June, Annual\r\nPreparing data source in Excel:\r\nCalculations from these two data sources were performed to create a new data table with age groups “25 to 54” and “55 & above” for labour force participation rate (LFPR) and labour force proportion with the following calculation method.\r\nLFPR = (Sum of labour force in age group / Sum of population in age group) *100\r\nLabour force proportion = (Sum of labour force in age group / Total labour force) * 100\r\n\r\n\r\n\r\nImporting Data Into Tableau:\r\nThe file was dragged and dropped into Tableau. Then, the Data sheet was dragged into the area labelled “Drag tables here”.\r\n\r\n\r\n\r\nChecking of Imported Data:\r\nThe data type of Year was changed to “Date” as shown below.\r\n\r\n\r\n\r\nData for LFPR and Proportion were ensured to be all in “Number (decimal)”.\r\n\r\n\r\n\r\nCreating Bar Charts:\r\nTo create the first chart for visualizing the data for “25 to 54”, the field “Year” was dragged into the Columns field. Then, “LFPR (25 to 54)” and Proportion (25 to 54)” were dragged into the Rows field.\r\n\r\n\r\n\r\nTo see only data for 2009 and 2019, “Year” was dragged into the Filters space. Then, only 2009 and 2019 were checked.\r\n\r\n\r\n\r\nThe chart title was renamed to “Age Group: 25 to 54”.\r\n\r\n\r\n\r\nThe proportion chart and LFPR chart were coloured to clearly identify which chart belongs to LFPR and which belongs to proportion.\r\n\r\n\r\n\r\nThe Y-axis were edited to fix the range at 0% to 100% and to rename the axis.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe same was repeated for age group 55 and above.\r\nCreating the Line Chart:\r\n“Year” was dragged into the Columns field, while the other 4 fields were pulled into the Rows field.\r\n\r\n\r\n\r\nMerging the Line Graphs Into One Chart:\r\nSince all 4 plots are in percentage, they can be merged into one chart. This was done by dragging the last three fields into the first chart’s axis.\r\n\r\n\r\n\r\n\r\n\r\n\r\nChanging Y-Axis:\r\nTo show the full 0% to 100%, the axis was edited by fixing the start and end of the range.\r\n\r\n\r\n\r\nColour-coding LFPR and Proportion:\r\nTo better visualize which plot refers to LFPR and Proportion, they were colour-coded by using the Edit Colours function.\r\n\r\n\r\n\r\n\r\n\r\n\r\nDashboard Assembly:\r\nThe 3 worksheets were pulled into the dashboard. Textboxes were added for the chart title, short summary as well as the data source. Blank spaces were added to aid alignment.\r\n\r\n\r\n\r\n3.0 The Observations\r\nThe growth of proportion in residents 55 and above in the labour force was substantial, rising by about 9%. While LFPR for both age groups increased, only age group 55 and above grew in proportion while age group 25 to 54 declined. This means that despite a proportion LFPR of people in age group 25 to 54 being part of the labour force, the contribution by this age group to total labour force still declined, showing that the population of this age group was shrinking.\r\nWhile there was a slight growth in LFPR for age group 25 to 54 from 2009 to 2019 (about 5%), it might be assumed that this is a steady rise. However, from the graph we can see that it only grew from 2009 to 2014, then started to decline from 2014 onwards steadily. This was not able to be captured if only data from 2009 and 2019 was taken for study. There might be an event that caused this age group to deviate from joining the work force, with reasons such as a push for furthering studies, or a significant proportion of the older residents who were contributing in LFPR in this age group transiting to the next age group (55 and above) from 2014 onwards.\r\nThe rise and decline for proportion of labour force are generally following a trend, with age group 25 to 54 seeing a steady decline while age group 55 and above a steady rise. This can be explained with the findings of Singapore’s shrinking birth rate, resulting in smaller population for each subsequent younger age group.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-02-dataviz-makeover-1/givenchart.png",
    "last_modified": "2021-02-04T00:22:18+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-01-31",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-31T23:16:58+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-31-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Timothy Lim",
        "url": "https://www.smu.edu.sg/"
      }
    ],
    "date": "2021-01-31",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-31-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-02-02T21:49:12+08:00",
    "input_file": "my-first-post.utf8.md"
  }
]
